{
  "module_slugs": {
    "SQL_INJECTION_MODULE_ID": "sql-injection"
  },
  "lessons": [
    {
      "module_id": "@SQL_INJECTION_MODULE_ID",
      "title": "Introduction to SQL Injection",
      "slug": "introduction-to-sql-injection",
      "description": "Learn the fundamentals of SQL injection vulnerabilities and how they can be exploited.",
      "content_type": "theory",
      "content": "# Introduction to SQL Injection\n\n## What is SQL Injection?\n\nSQL Injection is a code injection technique that exploits vulnerabilities in applications that interact with databases. It occurs when user-supplied data is not properly validated or sanitized before being included in SQL queries.\n\nWhen successful, SQL injection attacks can allow attackers to:\n\n- Access unauthorized data\n- Modify database data\n- Execute administrative operations on the database\n- In some cases, issue commands to the operating system\n\n## How SQL Injection Works\n\nSQL injection works by inserting or \"injecting\" malicious SQL code into queries that an application sends to its database. When the application builds SQL statements dynamically by concatenating strings that include user-supplied input, attackers can manipulate these inputs to change the structure and logic of the intended SQL query.\n\n### Example of Vulnerable Code\n\n```php\n$username = $_POST['username'];\n$password = $_POST['password'];\n\n$query = \"SELECT * FROM users WHERE username = '$username' AND password = '$password'\";\n$result = mysqli_query($connection, $query);\n```\n\nIn this example, an attacker could input `admin' --` as the username. The resulting query would be:\n\n```sql\nSELECT * FROM users WHERE username = 'admin' --' AND password = 'anything'\n```\n\nThe `--` is a SQL comment that causes the rest of the query to be ignored, effectively bypassing the password check.",
      "order_index": 0,
      "is_active": true
    },
    {
      "module_id": "@SQL_INJECTION_MODULE_ID",
      "title": "Types of SQL Injection Attacks",
      "slug": "types-of-sql-injection",
      "description": "Explore different types of SQL injection techniques and their impact.",
      "content_type": "theory",
      "content": "# Types of SQL Injection Attacks\n\n## In-band SQL Injection\n\nIn-band SQL injection is the most common and straightforward type of SQL injection attack. The attacker uses the same communication channel to both launch the attack and gather results.\n\n### Error-based SQL Injection\n\nError-based SQL injection relies on error messages thrown by the database server to obtain information about the structure of the database. If an application displays database error messages to users, attackers can deliberately cause errors that reveal information.\n\n### Union-based SQL Injection\n\nUNION-based SQL injection uses the UNION SQL operator to combine the results of two or more SELECT statements into a single result, which is then returned as part of the HTTP response.\n\nExample:\n```\n' UNION SELECT username, password FROM users --\n```\n\n## Blind SQL Injection\n\nBlind SQL injection occurs when an application is vulnerable to SQL injection, but its HTTP responses don't contain the results of the SQL query or the details of any database errors.\n\n### Boolean-based Blind SQL Injection\n\nIn boolean-based blind SQL injection, an attacker sends a SQL query to the database which forces the application to return a different result depending on whether the query returns TRUE or FALSE.\n\n### Time-based Blind SQL Injection\n\nTime-based blind SQL injection relies on the database pausing for a specified amount of time, then returning the results, allowing an attacker to determine if the result of a query is TRUE or FALSE based on the time the database takes to respond.\n\n## Out-of-band SQL Injection\n\nOut-of-band SQL injection occurs when an attacker is unable to use the same channel to launch the attack and gather results. Instead, data is retrieved using a different channel (e.g., making the database server send DNS or HTTP requests to a server controlled by the attacker).",
      "order_index": 1,
      "is_active": true
    },
    {
      "module_id": "@SQL_INJECTION_MODULE_ID",
      "title": "SQL Injection Prevention Techniques",
      "slug": "sql-injection-prevention",
      "description": "Learn best practices and techniques to prevent SQL injection vulnerabilities in your applications.",
      "content_type": "theory",
      "content": "# SQL Injection Prevention Techniques\n\n## 1. Use Parameterized Queries (Prepared Statements)\n\nParameterized queries are the most effective way to prevent SQL injection. They work by separating the SQL code from the data, ensuring that user input is never treated as part of the SQL command.\n\n### Example in PHP (PDO)\n\n```php\n$stmt = $pdo->prepare('SELECT * FROM users WHERE username = :username AND password = :password');\n$stmt->execute(['username' => $username, 'password' => $password]);\n$user = $stmt->fetch();\n```\n\n### Example in Python\n\n```python\ncursor.execute(\"SELECT * FROM users WHERE username = %s AND password = %s\", (username, password))\nuser = cursor.fetchone()\n```\n\n## 2. Use ORM Libraries\n\nObject-Relational Mapping (ORM) libraries typically use parameterized queries behind the scenes, providing an additional layer of protection.\n\n### Example with SQLAlchemy (Python)\n\n```python\nuser = session.query(User).filter(User.username == username, User.password == password).first()\n```\n\n## 3. Input Validation\n\nValidate user input to ensure it meets expected formats and constraints. While not a complete defense against SQL injection, it adds an important layer of security.\n\n## 4. Escape Special Characters\n\nIf parameterized queries cannot be used, properly escape special characters in user inputs. However, this approach is less secure and more prone to errors than using parameterized queries.\n\n## 5. Principle of Least Privilege\n\nEnsure database accounts used by applications have the minimum privileges necessary. This limits the potential damage if an SQL injection vulnerability is exploited.\n\n## 6. Use Stored Procedures\n\nStored procedures can provide protection against SQL injection if they don't include dynamic SQL generation based on unvalidated inputs.\n\n## 7. Keep Software Updated\n\nRegularly update your database software, web application frameworks, and libraries to protect against known vulnerabilities.\n\n## 8. Web Application Firewalls (WAFs)\n\nImplement a WAF as an additional layer of defense to help filter out malicious SQL injection attempts.",
      "order_index": 2,
      "is_active": true
    },
    {
      "module_id": "@SQL_INJECTION_MODULE_ID",
      "title": "SQL Injection Practical Exercise",
      "slug": "sql-injection-exercise",
      "description": "Practice identifying and exploiting SQL injection vulnerabilities in a controlled environment.",
      "content_type": "exercise",
      "content": "# SQL Injection Practical Exercise\n\n## Objective\n\nIn this exercise, you will practice identifying and exploiting SQL injection vulnerabilities in a controlled environment. You'll also learn how to fix these vulnerabilities.\n\n## Setup\n\n1. Navigate to the SQL Injection practice module in the SADP platform\n2. You'll see a simple login form that is vulnerable to SQL injection\n\n## Exercise 1: Basic Authentication Bypass\n\n### Task\n\nBypass the login form without knowing a valid username or password.\n\n### Hints\n\n1. Try using SQL comments to modify the query logic\n2. Remember that SQL comments in MySQL can be created using `--` or `#`\n3. You'll need to add a space after `--` for it to work as a comment\n\n### Solution\n\nEnter the following in the username field:\n```\nadmin' --\n```\n\nAnd anything (or nothing) in the password field.\n\n### Explanation\n\nThe vulnerable code likely constructs a query like:\n```sql\nSELECT * FROM users WHERE username = '$username' AND password = '$password'\n```\n\nYour input changes it to:\n```sql\nSELECT * FROM users WHERE username = 'admin' -- ' AND password = 'anything'\n```\n\nThe `--` comments out the password check, allowing you to log in as 'admin' without knowing the password.\n\n## Exercise 2: Data Extraction using UNION\n\n### Task\n\nUse a UNION-based SQL injection to extract user data from the database.\n\n### Hints\n\n1. First, determine the number of columns in the current query using `ORDER BY`\n2. Use UNION SELECT to extract data from other tables\n3. You may need to match data types across the UNION\n\n## Exercise 3: Fixing the Vulnerabilities\n\n### Task\n\nModify the vulnerable code to prevent SQL injection attacks.\n\n### Solution\n\nReplace the vulnerable code with parameterized queries:\n\n```php\n// Instead of:\n$query = \"SELECT * FROM users WHERE username = '$username' AND password = '$password'\";\n$result = mysqli_query($connection, $query);\n\n// Use:\n$stmt = $connection->prepare(\"SELECT * FROM users WHERE username = ? AND password = ?\");\n$stmt->bind_param(\"ss\", $username, $password);\n$stmt->execute();\n$result = $stmt->get_result();\n```",
      "order_index": 3,
      "is_active": true
    },
    {
      "module_id": "@SQL_INJECTION_MODULE_ID",
      "title": "SQL Injection in Real-World Applications",
      "slug": "sql-injection-real-world",
      "description": "Examine real-world SQL injection vulnerabilities and their impact on organizations.",
      "content_type": "theory",
      "content": "# SQL Injection in Real-World Applications\n\n## Notable SQL Injection Attacks\n\n### The Heartland Payment Systems Breach (2008)\n\nAttackers used SQL injection to compromise Heartland Payment Systems, one of the largest payment processors in the United States. They installed malware that captured credit card data, affecting approximately 134 million credit cards.\n\n**Impact**: Estimated financial losses exceeded $140 million in compensation payments and penalties.\n\n### Sony Pictures (2011)\n\nA group called LulzSec used SQL injection to breach Sony Pictures' database, compromising personal information of over 1 million users, including passwords, email addresses, and dates of birth.\n\n**Impact**: The breach cost Sony millions in security upgrades, legal fees, and damaged reputation.\n\n### Yahoo Data Breach (2012)\n\nAttackers used SQL injection to compromise a Yahoo database containing more than 450,000 user credentials.\n\n**Impact**: The breach exposed unencrypted usernames and passwords, leading to potential account compromises across multiple platforms due to password reuse.\n\n## Common Vulnerable Scenarios\n\n### Legacy Applications\n\nMany legacy applications were built before SQL injection was widely understood, making them particularly vulnerable. These applications often lack modern security controls and may use outdated coding practices.\n\n### Content Management Systems (CMS)\n\nPopular CMS platforms like WordPress, Joomla, and Drupal have been targets for SQL injection attacks, particularly through vulnerable plugins and themes.\n\n### Custom Web Applications\n\nCustom-built web applications often contain SQL injection vulnerabilities due to:\n- Lack of developer security awareness\n- Pressure to deliver features quickly\n- Insufficient testing and code review\n\n## Lessons Learned\n\n### Security as a Process, Not a Product\n\nOrganizations that suffered major SQL injection breaches often treated security as a one-time implementation rather than an ongoing process.\n\n### Defense in Depth\n\nSuccessful attacks typically exploited multiple weaknesses. Having multiple layers of defense can prevent or limit the damage of SQL injection attacks.\n\n### Regular Security Assessments\n\nRegular security assessments, including vulnerability scanning and penetration testing, can identify SQL injection vulnerabilities before attackers do.\n\n### Security Training\n\nDeveloper awareness and training are crucial. Many SQL injection vulnerabilities result from a lack of understanding of secure coding practices.",
      "order_index": 4,
      "is_active": true
    }
  ]
}
